[
  {
    "id": 1,
    "title": "Mastering Paint Correction: A Deep Dive",
    "content_type": "blog",
    "body": "Paint correction is an art form that restores your vehicle's finish to its pristine glory. This comprehensive guide covers everything from identifying imperfections to advanced polishing techniques. Learn how to remove swirl marks, scratches, and oxidation, revealing a mirror-like shine. We'll explore different types of abrasives, pads, and machines, ensuring you have the knowledge to achieve professional-level results. Discover the secrets to a flawless finish and protect your investment.",
    "image_url": "/images/hero/colorful-car.jpg",
    "is_published": true,
    "tags": "detailing, paint correction, car care, featured",
    "author": "Alex Johnson",
    "created_by": 1,
    "updated_by": 1,
    "created_at": "2024-01-15T10:00:00Z",
    "updated_at": "2024-01-15T10:00:00Z"
  },
  {
    "id": 2,
    "title": "The Ultimate Guide to Ceramic Coatings",
    "content_type": "blog",
    "body": "Ceramic coatings offer unparalleled protection and gloss for your vehicle's paintwork. This guide breaks down the science behind ceramic coatings, their benefits, and the application process. We'll compare different types of coatings, discuss proper surface preparation, and provide tips for maintaining your coated vehicle. Extend the life of your paint and keep your car looking showroom-new with the power of ceramic technology.",
    "image_url": "/images/hero/colorful-car.png",
    "is_published": true,
    "tags": "detailing, ceramic coating, paint protection",
    "author": "Maria Garcia",
    "created_by": 1,
    "updated_by": 1,
    "created_at": "2024-02-20T11:30:00Z",
    "updated_at": "2024-02-20T11:30:00Z"
  },
  {
    "id": 3,
    "title": "DIY Dent Removal: Tips and Tricks",
    "content_type": "blog",
    "body": "Minor dents can be a major eyesore. Learn how to tackle small dents yourself with our expert DIY guide. We'll cover various techniques, including paintless dent repair (PDR) methods, and recommend the right tools for the job. Understand when to call a professional and when you can save money with a DIY approach. Restore your car's smooth exterior with confidence.",
    "image_url": "/images/hero/colorful-car.jpg",
    "is_published": true,
    "tags": "repair, DIY, dents",
    "author": "David Lee",
    "created_by": 1,
    "updated_by": 1,
    "created_at": "2024-03-10T09:15:00Z",
    "updated_at": "2024-03-10T09:15:00Z"
  },
  {
    "id": 4,
    "title": "Rust Prevention and Treatment",
    "content_type": "blog",
    "body": "Rust can quickly degrade your vehicle's appearance and structural integrity. This article provides essential tips for preventing rust formation and effectively treating existing rust. We'll discuss common rust spots, protective coatings, and repair techniques. Keep your car rust-free and extend its lifespan with our practical advice.",
    "image_url": "/images/hero/colorful-car.jpg",
    "is_published": true,
    "tags": "maintenance, rust, car care",
    "author": "Sarah Chen",
    "created_by": 1,
    "updated_by": 1,
    "created_at": "2024-04-05T14:45:00Z",
    "updated_at": "2024-04-05T14:45:00Z"
  },
  {
    "id": 5,
    "title": "Choosing the Right Paint Color for Your Car",
    "content_type": "blog",
    "body": "Selecting a new paint color for your car is a big decision. This guide helps you navigate the options, from classic shades to custom hues. We'll discuss color trends, maintenance considerations, and how different colors can impact your car's resale value. Make an informed choice and give your vehicle a fresh, personalized look.",
    "image_url": "/images/hero/colorful-car.jpg",
    "is_published": true,
    "tags": "customization, paint, aesthetics",
    "author": "Emily White",
    "created_by": 1,
    "updated_by": 1,
    "created_at": "2024-05-12T16:00:00Z",
    "updated_at": "2024-05-12T16:00:00Z"
  },
  {
    "id": 6,
    "title": "Advanced Car Detailing Techniques",
    "content_type": "blog",
    "body": "Take your car detailing skills to the next level with these advanced techniques. From multi-stage paint correction to intricate interior cleaning, we cover methods used by professionals to achieve show-car results. Learn about specialized tools, products, and processes that will make your vehicle stand out.",
    "image_url": "/images/hero/colorful-car.jpg",
    "is_published": true,
    "tags": "detailing, advanced, car care",
    "author": "Chris Green",
    "created_by": 1,
    "updated_by": 1,
    "created_at": "2024-06-01T08:00:00Z",
    "updated_at": "2024-06-01T08:00:00Z"
  }
]